# Используем официальный образ Golang в качестве базового
FROM golang:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum, а затем выполняем загрузку зависимостей
COPY go.mod go.sum ./
RUN go mod download

# Копируем все файлы из текущей директории внутрь контейнера
COPY . .

# Собираем приложение
RUN go build -o main .

# Экспортируем порт, который слушает ваше приложение
EXPOSE 8080

# Команда для запуска приложения внутри контейнера
CMD ["./main"]
